{
  "matching_results": 17179217, 
  "results": [
    {
      "id": "NBKX2aDTOIKyZHeywh2kcJv8pcRw2pOKCmLSzFPBGZ9KIHbJzgglV4nXxW9QA5tf", 
      "score": 1.6273596, 
      "text": "Candace Kita Candace is an actress and writer living in Los Angeles, CA. You may have seen her as the face of Stila, Clear Essence, Nars, Herbalife, Youthful Luster Skincare, and Classified Cosmetics. In her spare time, she and her partner are creating a boutique wine brand and a line of luxury pet accessories. She believes in every woman's ability to be beautiful. www.candacekita.com Indulge Your Senses at the Most Romantic Restaurants in the World Canada favors veggies and eliminates dairy! You might remember learning about the food groups in elementary school. You were taught that the four basic food groups included fruit and vegetables , breads and cereals (this category can include bread, rice, pasta, cereals), dairy (this category can include milk, cheese, yogurt, and ice cream ) and meat (this category can include poultry, seafood, eggs, nuts, seeds, beans, and lentils). However, this system is now out of", 
      "title": "Canada Eliminates Dairy as a Food Group", 
      "url": "http://vivaglammagazine.com/canada-eliminates-dairy-as-a-food-group/"
    }, 
    {
      "id": "zib9q7a7Tgir9fcEKHMg3KgeWGQ-KnF_oCbXD4p308am2akCV8emQ5a09qUiVOss", 
      "score": 1.3442928, 
      "text": "Botanists Say There's No Such Thing As Vegetables, And We're Shook Then what have we been eating all this time? There’s an exhausting amount of talk over which foods are fruits and which are vegetables. Avocado ? Fruit . Zucchini ? Fruit. Kale ? Vegetable ... or is it? According to botanists, there is no such thing as a vegetable . Wolfgang Stuppy, a research leader in comparative plant and fungal biology at the U.K.’s world-renowned Royal Botanic Gardens, Kew & Wakehurst Place, told the BBC , “The term vegetable doesn’t exist in botanical terminology.” But fruit? Yep, that’s recognized by botanists. Confused? Let us break it down for you. What is a fruit? If you ask a cook, a fruit is an edible part of plant that is usually sweet and sometimes sour. Lemons, apples, strawberries ― these are all considered fruits by almost everyone. But if you ask", 
      "title": "Botanists Say There's No Such Thing As Vegetables, And We're Shook", 
      "url": "http://www.huffingtonpost.com/entry/botanists-no-such-thing-vegetables_us_593fdbcee4b0b13f2c6dcd9c"
    }, 
    {
      "id": "Vcn3ElQsDMDZAxkFkP--avrKm9vzjaAKotRKzBSNWzFgIRBf8C152TFzxb5rP_pD", 
      "score": 1.2843909, 
      "text": "Lake Macquarie’s top 17 highlights for 2017 With 2017 just heating up, global health food trends are taking a sharper nutrition focus than ever before. Gone are the days of solely quinoa and Greek yoghurt. Savvy health and fitness loving Australians can be ahead of the curve by knowing exactly which healthy foods are about to make their way onto our café menus and supermarket shelves in the coming months from all corners of the globe writes Kara Landau , The Travelling Dietitian. Natural functional foods It is no longer solely about what is taken out of the food (think gluten free, sugar free, dairy free trends) but rather what are we naturally getting out of the foods, and how will those nutrients benefit us; Examples include: Green banana flour providing mood booting 5HTP Kefir or probiotic enhanced waters offering gut healthy nutrients Baobab powder offering copious amounts of Vitamin", 
      "title": "5 new global health food and diet trends to watch out for in 2017", 
      "url": "http://www.the-retiree.com.au/5-new-global-health-food-and-diet-trends-to-watch-out-for-in-2017/"
    }, 
    {
      "id": "Blvpo2m08XC1ZaNNxOmjaPq9bQN0Ohze2YrSaVhiIDNsGNaUjpbdTD0Ef5PmxRGt", 
      "score": 1.2698568, 
      "text": "brazil nuts, soy and whole wheat ELLAGIC ACID apples, black currants, black walnuts, cherries, cranberries, grapes, pomegranate, raisins, raspberries and strawberries FIBER cacao/chocolate, chlorella, fruits (all), lucuma powder, lychee, maca powder, mesquite powder and vegetables (all) (Genuine cacao/chocolate is naturally vegan. It’s a bean.) FLAVONOIDS cacao/chocolate, fruits (all) and vegetables (all) (Genuine cacao/chocolate is naturally vegan. It’s a bean.) FLUORINE (destroyed by heat) alfalfa sprouts, almonds, avocados, beet greens, black tea, black-eyed peas, Brussels sprouts, cabbage, carrots, cauliflower, chlorella, dandelion greens, dates, endive, garlic, green tea, green vegetables (leafy), kelp, mustard greens, nuts, oats, parsley, rye, seaweed, seeds (all), spinach, tomato, turnip greens, watercress, wheat and wheatgrass FRUCTO-OLIGOSACCHARIDES artichokes, bananas, barley, garlic, onions and tomato GAMMA-CAROTENE – tomato GAMMA-LINOLENIC ACID – black currant seed oil and borage seed oil GERMANIUM – aloe vera, barley, chlorella, garlic, mushrooms (shiitake) and oats GLUTAMIC ACID – dates and mushrooms (shiitake) GLUTAMINE – oats,", 
      "title": "The EXACT Vegan Food To Literally Get Every Single Nutrient Your Body Will Ever Need (HUGE A-Z List) -", 
      "url": "http://inourishgently.com/every-single-nutrient-vegan/"
    }, 
    {
      "id": "vfRMNjeJ690YMrtKiaeLKkf5aDYjiC--AiAlwrtnOzXfsDXuhynSfLK73Vrv3-CY", 
      "score": 1.2576706, 
      "text": "The following is an excerpt from The Campbell Plan: The Simple Way to Lose Weight and Reverse Illness , which was released by Rodale Books. Remember the four food groups? I remember learning something about these as a little kid and even then, having no concept of calories or vitamins or minerals, I understood the recommendations right away. They were so simple. You could look at the poster and pretty much instantly assess whether your meal was adequate. Are you eating some meat, dairy, fruit or veggie, and bread or grain? A steak, rice pilaf, a glass of milk, and green beans was a perfect meal and it was immediately obvious. While the nutritional recommendations of more recent government schemes (pyramids, plates, etc.) have improved, I’m not sure anything has ever been as accessible as the basic four food groups. Making Nutrition Easy: The Three Food Groups I would like", 
      "title": "The Only Three Food Groups You Need to Remember", 
      "url": "https://www.forksoverknives.com/three-food-groups-healthy-eating/"
    }
  ]
}